a = int
i = 0
while a != 0:
    a = int (input ())
    i += a
print (i)
# Напишите программу, которая считывает со стандартного ввода целые числа,
# по одному числу в строке, и после первого введенного нуля выводит сумму полученных на вход чисел.
