a, b, c, d = int(input()), int(input()), int(input()), int(input())
for a in range(10):
    for

# n = int(input())
# for i in range(n):
#   print('* '*n)

# Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками.
# Для тренировок ему бы очень пригодилась программа, которая показывала бы блок таблицы умножения.
# Напишите программу, на вход которой даются четыре числа aa, bb, cc и dd, каждое в своей строке.

# Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка [a; b][a;b] на все числа
# отрезка [c;d][c;d]. Числа aa, bb, cc и dd являются натуральными и непревосходят 10, a≤b, c≤d.
# Следуйте формату вывода из примера, для разделения
# элементов внутри строки используйте '\t' — символ табуляции. Заметьте, что левым
# столбцом и верхней строкой выводятся сами числа из заданных отрезков —
# заголовочные столбец и строка таблицы.